PeterSommerlad/ArduinoCore-avr/variants/mega/pins_arduino.h
}


//static constexpr inline uint8_t digital_pin_to_BitMask_PS(uint8_t const pin) noexcept {
//	using PT=PinType;
//	switch (static_cast<PinType>(pin)) {
//		case PT::D00: case PT::D15: case PT::D17: case PT::D21: case PT::D22: case PT::D37: case PT::D41: case PT::D49: case PT::D53: case PT::D54: case PT::D62:
//			return bitmask_in_byte::b0;
//		case PT::D01: case PT::D14: case PT::D16: case PT::D20: case PT::D23: case PT::D36: case PT::D40: case PT::D48: case PT::D52: case PT::D55: case PT::D63:
//			return bitmask_in_byte::b1;
//
//		case PT::D19: case PT::D24: case PT::D35: case PT::D39: case PT::D47: case PT::D51: case PT::D56: case PT::D64:
//			return bitmask_in_byte::b2;
//
//		case PT::D05: case PT::D06: case PT::D18: case PT::D25: case PT::D34: case PT::D46: case PT::D50: case PT::D57: case PT::D65:
//			return bitmask_in_byte::b3;
//
//		case PT::D02: case PT::D07: case PT::D10: case PT::D26: case PT::D33: case PT::D45: case PT::D58: case PT::D66:
//			return bitmask_in_byte::b4;
//		case PT::D03: case PT::D04: case PT::D08: case PT::D11: case PT::D27: case PT::D32: case PT::D44: case PT::D59: case PT::D67:
//			return bitmask_in_byte::b5;
//		case PT::D09: case PT::D12: case PT::D28: case PT::D31: case PT::D43: case PT::D60: case PT::D68:
//			return bitmask_in_byte::b6;
//		case PT::D13: case PT::D29: case PT::D30: case PT::D38: case PT::D42: case PT::D61: case PT::D69:
//			return bitmask_in_byte::b7;
//	}
//	return 0; // 0 might break code, may be, but would be better indicator.
//}
};
#endif
#ifndef UsePetersCpp17
#ifdef ARDUINO_MAIN

const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
	// TIMERS		
	// -------------------------------------------		
	NOT_ON_TIMER	, // PE 0 ** 0 ** USART0_RX	
	NOT_ON_TIMER	, // PE 1 ** 1 ** USART0_TX	
	TIMER3B	, // PE 4 ** 2 ** PWM2	
	TIMER3C	, // PE 5 ** 3 ** PWM3	
	TIMER0B	, // PG 5 ** 4 ** PWM4	
	TIMER3A	, // PE 3 ** 5 ** PWM5	
	TIMER4A	, // PH 3 ** 6 ** PWM6	
	TIMER4B	, // PH 4 ** 7 ** PWM7	
	TIMER4C	, // PH 5 ** 8 ** PWM8	
	TIMER2B	, // PH 6 ** 9 ** PWM9	
	TIMER2A	, // PB 4 ** 10 ** PWM10	
	TIMER1A	, // PB 5 ** 11 ** PWM11	
	TIMER1B	, // PB 6 ** 12 ** PWM12	
	TIMER0A	, // PB 7 ** 13 ** PWM13	
	NOT_ON_TIMER	, // PJ 1 ** 14 ** USART3_TX	
	NOT_ON_TIMER	, // PJ 0 ** 15 ** USART3_RX	
	NOT_ON_TIMER	, // PH 1 ** 16 ** USART2_TX	
	NOT_ON_TIMER	, // PH 0 ** 17 ** USART2_RX	
	NOT_ON_TIMER	, // PD 3 ** 18 ** USART1_TX	
	NOT_ON_TIMER	, // PD 2 ** 19 ** USART1_RX	
	NOT_ON_TIMER	, // PD 1 ** 20 ** I2C_SDA	
	NOT_ON_TIMER	, // PD 0 ** 21 ** I2C_SCL	
	NOT_ON_TIMER	, // PA 0 ** 22 ** D22	
	NOT_ON_TIMER	, // PA 1 ** 23 ** D23	
	NOT_ON_TIMER	, // PA 2 ** 24 ** D24	
	NOT_ON_TIMER	, // PA 3 ** 25 ** D25	
	NOT_ON_TIMER	, // PA 4 ** 26 ** D26	
	NOT_ON_TIMER	, // PA 5 ** 27 ** D27	
	NOT_ON_TIMER	, // PA 6 ** 28 ** D28	
	NOT_ON_TIMER	, // PA 7 ** 29 ** D29	
	NOT_ON_TIMER	, // PC 7 ** 30 ** D30	
	NOT_ON_TIMER	, // PC 6 ** 31 ** D31	
	NOT_ON_TIMER	, // PC 5 ** 32 ** D32	
	NOT_ON_TIMER	, // PC 4 ** 33 ** D33	
	NOT_ON_TIMER	, // PC 3 ** 34 ** D34	
	NOT_ON_TIMER	, // PC 2 ** 35 ** D35	
	NOT_ON_TIMER	, // PC 1 ** 36 ** D36	
	NOT_ON_TIMER	, // PC 0 ** 37 ** D37	
	NOT_ON_TIMER	, // PD 7 ** 38 ** D38	
	NOT_ON_TIMER	, // PG 2 ** 39 ** D39	
	NOT_ON_TIMER	, // PG 1 ** 40 ** D40	
	NOT_ON_TIMER	, // PG 0 ** 41 ** D41	
	NOT_ON_TIMER	, // PL 7 ** 42 ** D42	
	NOT_ON_TIMER	, // PL 6 ** 43 ** D43	
	TIMER5C	, // PL 5 ** 44 ** D44	
	TIMER5B	, // PL 4 ** 45 ** D45	
	TIMER5A	, // PL 3 ** 46 ** D46	
	NOT_ON_TIMER	, // PL 2 ** 47 ** D47	
	NOT_ON_TIMER	, // PL 1 ** 48 ** D48	
	NOT_ON_TIMER	, // PL 0 ** 49 ** D49	
	NOT_ON_TIMER	, // PB 3 ** 50 ** SPI_MISO	
	NOT_ON_TIMER	, // PB 2 ** 51 ** SPI_MOSI	
	NOT_ON_TIMER	, // PB 1 ** 52 ** SPI_SCK	
	NOT_ON_TIMER	, // PB 0 ** 53 ** SPI_SS	
	NOT_ON_TIMER	, // PF 0 ** 54 ** A0	
	NOT_ON_TIMER	, // PF 1 ** 55 ** A1	
	NOT_ON_TIMER	, // PF 2 ** 56 ** A2	
	NOT_ON_TIMER	, // PF 3 ** 57 ** A3	
	NOT_ON_TIMER	, // PF 4 ** 58 ** A4	
	NOT_ON_TIMER	, // PF 5 ** 59 ** A5	
	NOT_ON_TIMER	, // PF 6 ** 60 ** A6	
	NOT_ON_TIMER	, // PF 7 ** 61 ** A7	
	NOT_ON_TIMER	, // PK 0 ** 62 ** A8	
	NOT_ON_TIMER	, // PK 1 ** 63 ** A9	
	NOT_ON_TIMER	, // PK 2 ** 64 ** A10	
	NOT_ON_TIMER	, // PK 3 ** 65 ** A11	
	NOT_ON_TIMER	, // PK 4 ** 66 ** A12	
	NOT_ON_TIMER	, // PK 5 ** 67 ** A13	
	NOT_ON_TIMER	, // PK 6 ** 68 ** A14	
	NOT_ON_TIMER	, // PK 7 ** 69 ** A15	
};

#endif
#else
constexpr inline timer_values digital_pin_to_timer_PS(PinType const pin) noexcept {
	using PT=PinType;
	constexpr timer_values timermap[] {
		/* PT::D02 */	 TIMER3B,
		/* PT::D03 */	 TIMER3C,
		/* PT::D04 */	 TIMER0B,
		/* PT::D05 */ TIMER3A,
		/* PT::D06 */ TIMER4A,
		/* PT::D07 */ TIMER4B,
		/* PT::D08 */ TIMER4C,
		/* PT::D09 */ TIMER2B,
		/* PT::D10 */ TIMER2A,
		/* PT::D11 */ TIMER1A,
		/* PT::D12 */ TIMER1B,
		/* PT::D13 */ TIMER0A,
		/* PT::D44 */ TIMER5C,
		/* PT::D45 */ TIMER5B,
		/* PT::D46 */ TIMER5A
	};
	if (pin>=PT::D02 && pin <= PT::D13){
		return timermap[pin-PT::D02];
	} else if (pin >=PT::D44 && pin <= PT::D46){
		return timermap[pin-PT::D44 + 12];
	}
	return NOT_ON_TIMER;

}
// from wiring_private
#ifndef cbi
#define cbi(sfr, bit) (_SFR_BYTE(sfr) &= ~_BV(bit))
#define CBI_SET
#endif
#ifndef sbi
#define sbi(sfr, bit) (_SFR_BYTE(sfr) |= _BV(bit))
#define SBI_SET
#endif
#if not_very_efficient_attempt
template<PinType pin>
inline void analog_pin_to_timer_turnoff() noexcept {
	using PT=PinType;
	using funptr=void(*)();
	constexpr funptr  timer_turnoff_map[] {
		/* PT::D02 */	[]{cbi(TCCR3A, COM3B1);}, // 0x90 TIMER3B,
		/* PT::D03 */	[]{cbi(TCCR3A, COM3C1);}, // 0x90 TIMER3C,
		/* PT::D04 */	[]{cbi(TCCR0A, COM0B1);}, // 0x24 TIMER0B,
		/* PT::D05 */   []{cbi(TCCR3A, COM3A1);}, // 0x90 TIMER3A,
		/* PT::D06 */   []{cbi(TCCR4A, COM4A1);}, // 0xC0 TIMER4A,
		/* PT::D07 */   []{cbi(TCCR4A, COM4B1);}, // 0xC0 TIMER4B,
		/* PT::D08 */   []{cbi(TCCR4A, COM4C1);}, // 0xC0 TIMER4C,
		/* PT::D09 */   []{cbi(TCCR2A, COM2B1);},// 0xB0 TIMER2B,
		/* PT::D10 */   []{cbi(TCCR2A, COM2A1);},// 0xB0 TIMER2A,
		/* PT::D11 */   []{cbi(TCCR1A, COM1A1);}, // 0x80 TIMER1A,
		/* PT::D12 */   []{cbi(TCCR1A, COM1B1);}, // 0x80 TIMER1B,
		/* PT::D13 */   []{cbi(TCCR0A, COM0A1);}, // 0x24 TIMER0A,
		/* PT::D44 */   []{cbi(TCCR5A, COM5C1);},// 0x120 TIMER5C,
		/* PT::D45 */   []{cbi(TCCR5A, COM5B1);},// 0x120 TIMER5B,
		/* PT::D46 */   []{cbi(TCCR5A, COM5A1);}  // 0x120 TIMER5A
	};
	if (pin>=PT::D02 && pin <= PT::D13){
		timer_turnoff_map[pin-PT::D02]();
	} else if (pin >=PT::D44 && pin <= PT::D46){
		timer_turnoff_map[pin-PT::D44 + 12]();
	}
}

