PeterSommerlad/ArduinoCore-avr/variants/mega/pins_arduino.h
inline void analog_pin_to_timer_turnoff(PinType const pin) noexcept {
	using PT=PinType;
	using funptr=void(*)();
	constexpr funptr  timer_turnoff_map[] {
		/* PT::D02 */	[]{cbi(TCCR3A, COM3B1);}, // 0x90 TIMER3B,
		/* PT::D03 */	[]{cbi(TCCR3A, COM3C1);}, // 0x90 TIMER3C,
		/* PT::D04 */	[]{cbi(TCCR0A, COM0B1);}, // 0x24 TIMER0B,
		/* PT::D05 */   []{cbi(TCCR3A, COM3A1);}, // 0x90 TIMER3A,
		/* PT::D06 */   []{cbi(TCCR4A, COM4A1);}, // 0xC0 TIMER4A,
		/* PT::D07 */   []{cbi(TCCR4A, COM4B1);}, // 0xC0 TIMER4B,
		/* PT::D08 */   []{cbi(TCCR4A, COM4C1);}, // 0xC0 TIMER4C,
		/* PT::D09 */   []{cbi(TCCR2A, COM2B1);},// 0xB0 TIMER2B,
		/* PT::D10 */   []{cbi(TCCR2A, COM2A1);},// 0xB0 TIMER2A,
		/* PT::D11 */   []{cbi(TCCR1A, COM1A1);}, // 0x80 TIMER1A,
		/* PT::D12 */   []{cbi(TCCR1A, COM1B1);}, // 0x80 TIMER1B,
		/* PT::D13 */   []{cbi(TCCR0A, COM0A1);}, // 0x24 TIMER0A,
		/* PT::D44 */   []{cbi(TCCR5A, COM5C1);},// 0x120 TIMER5C,
		/* PT::D45 */   []{cbi(TCCR5A, COM5B1);},// 0x120 TIMER5B,
		/* PT::D46 */   []{cbi(TCCR5A, COM5A1);}  // 0x120 TIMER5A
	};
	if (pin>=PT::D02 && pin <= PT::D13){
		timer_turnoff_map[pin-PT::D02]();
	} else if (pin >=PT::D44 && pin <= PT::D46){
		timer_turnoff_map[pin-PT::D44 + 12]();
	}
}


inline void analog_pin_to_timer_prepare(uint8_t const pin) noexcept {
	using PT=PinType;
	using funptr=void(*)();
	constexpr funptr  timer_prepare_map[] {
		/* PT::D02 */	[]{sbi(TCCR3A, COM3B1);}, // 0x90 TIMER3B,
		/* PT::D03 */	[]{sbi(TCCR3A, COM3C1);}, // 0x90 TIMER3C,
		/* PT::D04 */	[]{sbi(TCCR0A, COM0B1);}, // 0x24 TIMER0B,
		/* PT::D05 */   []{sbi(TCCR3A, COM3A1);}, // 0x90 TIMER3A,
		/* PT::D06 */   []{sbi(TCCR4A, COM4A1);
		#if defined(COM4A0)
						   cbi(TCCR4A, COM4A0);
		#endif
		}, // 0xC0 TIMER4A,
		/* PT::D07 */   []{sbi(TCCR4A, COM4B1);}, // 0xC0 TIMER4B,
		/* PT::D08 */   []{sbi(TCCR4A, COM4C1);}, // 0xC0 TIMER4C,
		/* PT::D09 */   []{sbi(TCCR2A, COM2B1);},// 0xB0 TIMER2B,
		/* PT::D10 */   []{sbi(TCCR2A, COM2A1);},// 0xB0 TIMER2A,
		/* PT::D11 */   []{sbi(TCCR1A, COM1A1);}, // 0x80 TIMER1A,
		/* PT::D12 */   []{sbi(TCCR1A, COM1B1);}, // 0x80 TIMER1B,
		/* PT::D13 */   []{sbi(TCCR0A, COM0A1);}, // 0x24 TIMER0A,
		/* PT::D44 */   []{sbi(TCCR5A, COM5C1);},// 0x120 TIMER5C,
		/* PT::D45 */   []{sbi(TCCR5A, COM5B1);},// 0x120 TIMER5B,
		/* PT::D46 */   []{sbi(TCCR5A, COM5A1);}  // 0x120 TIMER5A
	};
	if (pin>=PT::D02 && pin <= PT::D13){
		timer_prepare_map[pin-PT::D02]();
	} else if (pin >=PT::D44 && pin <= PT::D46){
		timer_prepare_map[pin-PT::D44 + 12]();
	}
}
constexpr
inline void analog_pin_to_timer_assign(uint8_t const pin,int val) noexcept {
	using PT=PinType;
	using funptr=void(*)(int);
	constexpr funptr  timer_assign_map[] { // using lambdas to deal with different types of OCR registers (8vs16 bit)
		/* PT::D02 */	[](int val){OCR3B = val; }, // 0x90 TIMER3B,
		/* PT::D03 */	[](int val){OCR3C = val; }, // 0x90 TIMER3C,
		/* PT::D04 */	[](int val){OCR0B = val; }, // 0x24 TIMER0B,
		/* PT::D05 */   [](int val){OCR3A = val; }, // 0x90 TIMER3A,
		/* PT::D06 */   [](int val){OCR4A = val; }, // 0xC0 TIMER4A,
		/* PT::D07 */   [](int val){OCR4B = val; }, // 0xC0 TIMER4B,
		/* PT::D08 */   [](int val){OCR4C = val; }, // 0xC0 TIMER4C,
		/* PT::D09 */   [](int val){OCR2B = val; },// 0xB0 TIMER2B,
		/* PT::D10 */   [](int val){OCR2A = val; },// 0xB0 TIMER2A,
		/* PT::D11 */   [](int val){OCR1A = val; }, // 0x80 TIMER1A,
		/* PT::D12 */   [](int val){OCR1B = val; }, // 0x80 TIMER1B,
		/* PT::D13 */   [](int val){OCR0A = val; }, // 0x24 TIMER0A,
		/* PT::D44 */   [](int val){OCR5C = val; },// 0x120 TIMER5C,
		/* PT::D45 */   [](int val){OCR5B = val; },// 0x120 TIMER5B,
		/* PT::D46 */   [](int val){OCR5A = val; }  // 0x120 TIMER5A
	};
	if (pin>=PT::D02 && pin <= PT::D13){
		timer_assign_map[pin-PT::D02](val);
	} else if (pin >=PT::D44 && pin <= PT::D46){
		timer_assign_map[pin-PT::D44 + 12](val);
	}
}
#endif

template <uint8_t pin, uint8_t val>
void digitalWrite();

#include "pwm_timer_handling.h"
// template variations/non-argument overloads in pwm_timer_handling

inline void analog_timer_turnoff(timer_values const theTimer) noexcept {
	switch (theTimer) {
	case TIMER0A: analog_timer_turnoff<TIMER0A>(); break;
	case TIMER0B: analog_timer_turnoff<TIMER0B>(); break;
	case TIMER1A: analog_timer_turnoff<TIMER1A>(); break;
	case TIMER1B: analog_timer_turnoff<TIMER1B>(); break;
	case TIMER1C: analog_timer_turnoff<TIMER1C>(); break;
	case TIMER2A: analog_timer_turnoff<TIMER2A>(); break;
	case TIMER2B: analog_timer_turnoff<TIMER2B>(); break;
	case TIMER3A: analog_timer_turnoff<TIMER3A>(); break;
	case TIMER3B: analog_timer_turnoff<TIMER3B>(); break;
	case TIMER3C: analog_timer_turnoff<TIMER3C>(); break;
	case TIMER4A: analog_timer_turnoff<TIMER4A>(); break;
	case TIMER4B: analog_timer_turnoff<TIMER4B>(); break;
	case TIMER4C: analog_timer_turnoff<TIMER4C>(); break;
	case TIMER5A: analog_timer_turnoff<TIMER5A>(); break;
	case TIMER5B: analog_timer_turnoff<TIMER5B>(); break;
	case TIMER5C: analog_timer_turnoff<TIMER5C>(); break;
	default:;
	}
}
inline void analog_pin_to_timer_turnoff(PinType const pin) noexcept {
	auto const theTimer = digital_pin_to_timer_PS(pin);
	analog_timer_turnoff(theTimer); // this way hope for better constant folding and inlining
}
inline void setPWMValue(timer_values const theTimer, int val) noexcept {
	switch (theTimer) {
	case TIMER0A: setPWMValue<TIMER0A>(val); break;
	case TIMER0B: setPWMValue<TIMER0B>(val); break;
	case TIMER1A: setPWMValue<TIMER1A>(val); break;
	case TIMER1B: setPWMValue<TIMER1B>(val); break;
	case TIMER1C: setPWMValue<TIMER1C>(val); break;
	case TIMER2A: setPWMValue<TIMER2A>(val); break;
	case TIMER2B: setPWMValue<TIMER2B>(val); break;
	case TIMER3A: setPWMValue<TIMER3A>(val); break;
	case TIMER3B: setPWMValue<TIMER3B>(val); break;
	case TIMER3C: setPWMValue<TIMER3C>(val); break;
	case TIMER4A: setPWMValue<TIMER4A>(val); break;
	case TIMER4B: setPWMValue<TIMER4B>(val); break;
	case TIMER4C: setPWMValue<TIMER4C>(val); break;
	case TIMER5A: setPWMValue<TIMER5A>(val); break;
	case TIMER5B: setPWMValue<TIMER5B>(val); break;
	case TIMER5C: setPWMValue<TIMER5C>(val); break;
	default:;
	}
}

// no need for further constant folding? try it anyway
template <uint8_t pin,uint8_t  mode>
inline
void pinMode()
{
	constexpr uint8_t const bit = digitalPinToBitMask(pin);
	constexpr PortType const port = digitalPinToPort(pin);


	if constexpr (port == NO_PORT) return;

	 volatile uint8_t * const reg = portModeRegister(port);
	 volatile uint8_t * const out = portOutputRegister(port);
	if constexpr (mode == INPUT) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out &= ~bit;
	} else if constexpr (mode == INPUT_PULLUP) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out |= bit;
	} else {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg |= bit;
	}
}

template <uint8_t pin>
inline
void pinMode(uint8_t const mode)
{
	constexpr uint8_t const bit = digitalPinToBitMask(pin);
	constexpr PortType const port = digitalPinToPort(pin);


	if constexpr (port == NO_PORT) return;

	 volatile uint8_t *  reg = portModeRegister(port);
	 volatile uint8_t *  out = portOutputRegister(port);
	if (mode == INPUT) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out &= ~bit;
	} else if (mode == INPUT_PULLUP) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out |= bit;
	} else {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg |= bit;
	}
}

inline
void pinMode(uint8_t const pin, uint8_t const mode)
{
	uint8_t const bit = digitalPinToBitMask(pin);
	PortType const port = digitalPinToPort(pin);


	if (port == NO_PORT) return;

	volatile uint8_t * const reg = portModeRegister(port);
	volatile uint8_t * const out = portOutputRegister(port);
	if (mode == INPUT) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out &= ~bit;
	} else if (mode == INPUT_PULLUP) {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg &= ~bit;
		*out |= bit;
	} else {
		SafeStatusRegisterAndClearInterrupt safe;
		*reg |= bit;
	}
}
inline
void digitalWrite(uint8_t const pin, uint8_t const val)
{
	auto const timer = digitalPinToTimer(static_cast<PinType>(pin));
	auto const port = digital_pin_to_Port_PS(static_cast<PinType>(pin));
	auto const bit = bitmask::digital_pin_to_BitMask_PS(static_cast<PinType>(pin));

